10/data/attachments/7cbfcc451297c504.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2c1b31c5-c3fd-411f-bd6d-e929b1593c3f</nif:username>
            <nif:friendToBeAdded>Nicholas_now_Friend_1529_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>